"""
Функции ежедневника
"""

def zadacha1():
    print('Эта функция будет выводить список всех задач со статусом выполнения за указанный день. По умолчанию, за текущий день.')

def zadacha2():
    print('Эта функция будет добавлять новую задачу в указанное время.')
          
def zadacha3():
    print('Эта функция будет редактировать задачу, используя уникальный идентификатор в БД. Если задача не найдена, то выводится ошибка.')

def zadacha4():
    print('Эта функция будет менять статус задачи на Выполнено.')
   
def zadacha5():
    print('Эта функция будет менять статус задачи на Не выполнено.')
          
def zadacha6():
    print('Выход.')
    

