#Task3
x1 = int(input('Координата х первой точки: '))
y1 = int(input('Координата y первой точки: '))
x2 = int(input('Координата х второй точки: '))
y2 = int(input('Координата y второй точки: '))
x3 = int(input('Координата х третьей точки: '))
y3 = int(input('Координата y третьей точки: '))

a = ((x1 - x2) ** 2 + (y1 - y2) ** 2) ** (1 / 2)
b = ((x2 - x3) ** 2 + (y2 - y3) ** 2) ** (1 / 2)
c = ((x1 - x3) ** 2 + (y1 - y3) ** 2) ** (1 / 2)

#print(a, b, c)
l = [a, b, c]
l.sort()
a, b, c = l[0], l[1], l[2]
#print(a, b, c)

print('Треугольник прямоугольный') if c == (a**2 + b**2) ** (1 / 2) else print('Треугольник НЕпрямоугольный')
